app/views/boxes/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "collections" ON "recipes"."id" = "collections"."recipe_id" WHERE "collections"."box_id" = $1  [["box_id", 14]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "collections" ON "recipes"."id" = "collections"."recipe_id" WHERE "collections"."box_id" = $1  [["box_id", 40]]
---
						<li>
						Number of Recipes in Box: <%= @box.recipes.count %>