app/controllers/boxes_controller.rb

SELECT "boxes".* FROM "boxes"
---
    def index
      @boxes = Box.all

SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @box = Box.find(params[:id])

INSERT INTO "boxes" ("theme", "title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["theme", "PizzaDude"], ["title", "I need a sandwhich"], ["created_at", 2016-08-10 17:32:27 UTC], ["updated_at", 2016-08-10 17:32:27 UTC], ["user_id", 1]]
---
    def create
      @box = current_user.boxes.build(box_params)
      @box.save!

SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit
      @box = Box.find(params[:id])

SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "boxes" SET "theme" = $1, "title" = $2, "image" = $3, "updated_at" = $4 WHERE "boxes"."id" = $5  [["theme", "NY Stuff"], ["title", "Pizza and shit"], ["image", "#<ActionDispatch::Http::UploadedFile:0x007fe7059abc78>"], ["updated_at", 2016-08-10 17:22:43 UTC], ["id", 29]]
---
    def update
      @box = Box.find(params[:id])
      @box.update(box_params)

SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "boxes" WHERE "boxes"."id" = $1  [["id", 3]]
---
    def destroy
      @box = Box.find(params[:id])
      @box.destroy