app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "ingredients", "directions", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "21"], ["ingredients", "Chicken Pie"], ["directions", "Heat it up "], ["image", "shepards.jpg"], ["created_at", 2016-08-09 21:31:35 UTC], ["updated_at", 2016-08-09 21:31:35 UTC]]
INSERT INTO "collections" ("box_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["box_id", 14], ["recipe_id", 46], ["created_at", 2016-08-10 15:05:12 UTC], ["updated_at", 2016-08-10 15:05:12 UTC]]
---
  def create
    @recipe = Recipe.create!(recipe_params)
    Collection.create!(recipe_id: @recipe.id, box_id: params[:recipe][:box_ids])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = $1, "directions" = $2, "image" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5  [["title", "Chicken Fried Steak"], ["directions", ""], ["image", "chickenfried.jpeg"], ["updated_at", 2016-08-08 22:40:30 UTC], ["id", 10]]
---
  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)